# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

In [3]:
lst = [4, 8, 15, 16, 23, 42]

data = pd.Series(lst)
print(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [5]:
var = ['january', 'February', 'march', 'april','may','june', 'july', 'august', 'september', 'october', 'november', 'december' ]

data1 = pd.Series(var)

print(data1)

0       january
1      February
2         march
3         april
4           may
5          june
6          july
7        august
8     september
9       october
10     november
11     december
dtype: object

# Q3. Create a Pandas DataFrame that contains the following data:

In [15]:
data = {
    'Name': ['Alice', 'bob', 'Claire'],
    'Age': [25,30,27],
    'Gender': ['Female', 'Male', 'Female']
}

file = pd.DataFrame(data)

file

     Name  Age  Gender
0   Alice   25  Female
1     bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In pandas, a DataFrame is a two-dimensional labeled data structure that represents tabular data. It consists of rows and columns, similar to a spreadsheet or a SQL table. A DataFrame can store data of different types (numeric, string, boolean, etc.) and allows for data manipulation, analysis, and processing.

On the other hand, a Series in pandas is a one-dimensional labeled array that can store data of any type. It is similar to a column in a DataFrame or a single column from a spreadsheet. Each element in a Series has a unique label called an index

In [17]:
# Creating a Series
series = pd.Series([4, 8, 15, 16, 23, 42], name='Numbers')
series

0     4
1     8
2    15
3    16
4    23
5    42
Name: Numbers, dtype: int64

In [21]:
#Creating a DataFrame
data = {
    'Name': ['Ritesh', 'Versha', 'Neha', 'Rohit'],
    'Age': [25, 28, 30, 27],
    'City': ['Mumbai', 'varanasi', 'Mirzapur', 'Prayagraj']
}
df = pd.DataFrame(data)
df

     Name  Age       City
0  Ritesh   25     Mumbai
1  Versha   28   varanasi
2    Neha   30   Mirzapur
3   Rohit   27  Prayagraj

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [37]:
df

print(df.info()) # Provide a summary of the DataFrame, including column names, data types, and non-null counts.

print(df.describe()) # Provide a summary of the DataFrame, including column names, data types, and non-null counts.

print(df.head()) #  Display the first n rows of a DataFrame.

print(df.tail()) # Display the last n rows of a DataFrame.

print(df.index) #   Display the last n rows of a DataFrame.

print(df.columns )#  Return the column labels of the DataFrame.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes
None
             Age
count   4.000000
mean   27.500000
std     2.081666
min    25.000000
25%    26.500000
50%    27.500000
75%    28.500000
max    30.000000
     Name  Age       City
0  Ritesh   25     Mumbai
1  Versha   28   varanasi
2    Neha   30   Mirzapur
3   Rohit   27  Prayagraj
     Name  Age       City
0  Ritesh   25     Mumbai
1  Versha   28   varanasi
2    Neha   30   Mirzapur
3   Rohit   27  Prayagraj
RangeIndex(start=0, stop=4, step=1)
Index(['Name', 'Age', 'City'], dtype='object')

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

A mutable object can be modified after its creation. In the context of pandas, Series and DataFrame are mutable, it means that you can modify the data, add or remove elements, change values, or reassign values to a Series or DataFrame.

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [40]:
name = pd.Series(['Ritesh', 'Versha', 'Neha', 'Rohit'])
age = pd.Series([25, 28, 30, 27])
city = pd.Series(['Mumbai', 'varanasi', 'Mirzapur', 'Prayagraj'])

data = {
    'Name': name,
    'Age': age,
    'City': city
}

file = pd.DataFrame(data)

print(file)

     Name  Age       City
0  Ritesh   25     Mumbai
1  Versha   28   varanasi
2    Neha   30   Mirzapur
3   Rohit   27  Prayagraj